Config/InformationRegisters/МетодыРаспределенияКосвенныхЗатратОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>МетодыРаспределенияКосвенныхЗатратОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БазаРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БазыРаспределенияКосвенныхЗатрат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВключатьВБазуОплатаТрудаКЭК212</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВключатьВБазуОплатаТрудаКЭК213</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВключатьВБазуОплатаТрудаКЭК214</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОсновнаяБаза</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеДействует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбщихЗатратНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбщихЗатратНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/БазыРаспределенияКосвенныхЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>БазыРаспределенияКосвенныхЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаТруда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериальныеЗатраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрямыеЗатраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выручка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РучноеРаспределение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрируетсяВручную</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/InformationRegisters/МетодыРаспределенияКосвенныхЗатратОрганизаций/Forms/ФормаЗаписиНастройка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация						= Параметры.Организация;
	ВидОбщихЗатратНаПроизводство	= Параметры.ВидОбщихЗатратНаПроизводство;
	Период							= Параметры.Период;
	ПериодПрежний					= Параметры.Период;
	ВключатьВБазуОплатаТрудаКЭК212  = Параметры.ВключатьВБазуОплатаТрудаКЭК212;
	ВключатьВБазуОплатаТрудаКЭК213  = Параметры.ВключатьВБазуОплатаТрудаКЭК213;
	ВключатьВБазуОплатаТрудаКЭК214  = Параметры.ВключатьВБазуОплатаТрудаКЭК214;
	
	ЭтоНовый = НЕ ЗначениеЗаполнено(Период);
	
	Если НЕ ЭтоНовый Тогда
		ПрочитатьМетодыРаспределения();
	КонецЕсли;
	РегистрыСведений.МетодыРаспределенияКосвенныхЗатратОрганизаций.УстановитьСвойстваЭлементовУчитываемыхКЭКОплатаТруда(ЭтотОбъект);
	УстановитьВидимостьКОСГУОплатаТруда(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Период = НачалоМесяца(Период);
КонецПроцедуры

&НаКлиенте
Процедура БазаРаспределенияПриИзменении(Элемент)
	УстановитьВидимостьКОСГУОплатаТруда(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Перечитать(Команда)
	ПрочитатьМетодыРаспределения();
	Модифицированность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	Если ДанныеЗаполненыКорректно() Тогда
		Если ЗаписатьМетодыРаспределения() Тогда
			Модифицированность = Ложь;
			Оповестить("ИзменениеМетодовРаспределенияКосвенныхЗатрат");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Если ДанныеЗаполненыКорректно() Тогда
		Если ЗаписатьМетодыРаспределения() Тогда
			Модифицированность = Ложь;
			Оповестить("ИзменениеМетодовРаспределенияКосвенныхЗатрат");
			Закрыть();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьКОСГУОплатаТруда(Форма)
	Видимость = Форма.БазаРаспределения = ПредопределенноеЗначение("Перечисление.БазыРаспределенияКосвенныхЗатрат.ОплатаТруда");
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("ВключатьВБазуОплатаТрудаКЭК211");
	ИменаЭлементов.Добавить("ВключатьВБазуОплатаТрудаКЭК212");
	ИменаЭлементов.Добавить("ВключатьВБазуОплатаТрудаКЭК213");
	ИменаЭлементов.Добавить("ВключатьВБазуОплатаТрудаКЭК214");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементов,
		"Видимость", Видимость);
КонецПроцедуры

&НаСервере
Процедура ПрочитатьМетодыРаспределения()

	РасширеннаяНастройка.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МетодыРаспределенияКосвенныхЗатратОрганизацийСрезПоследних.КФО,
	               |	МетодыРаспределенияКосвенныхЗатратОрганизацийСрезПоследних.ИФО,
	               |	МетодыРаспределенияКосвенныхЗатратОрганизацийСрезПоследних.БазаРаспределения,
	               |	МетодыРаспределенияКосвенныхЗатратОрганизацийСрезПоследних.ОсновнаяБаза,
	               |	МетодыРаспределенияКосвенныхЗатратОрганизацийСрезПоследних.НеДействует,
	               |	МетодыРаспределенияКосвенныхЗатратОрганизацийСрезПоследних.ВключатьВБазуОплатаТрудаКЭК212,
	               |	МетодыРаспределенияКосвенныхЗатратОрганизацийСрезПоследних.ВключатьВБазуОплатаТрудаКЭК213,
	               |	МетодыРаспределенияКосвенныхЗатратОрганизацийСрезПоследних.ВключатьВБазуОплатаТрудаКЭК214
	               |ИЗ
	               |	РегистрСведений.МетодыРаспределенияКосвенныхЗатратОрганизаций.СрезПоследних(
	               |			&Период,
	               |			Организация = &Организация
	               |				И ВидОбщихЗатратНаПроизводство = &ВидОбщихЗатратНаПроизводство) КАК МетодыРаспределенияКосвенныхЗатратОрганизацийСрезПоследних
	               |ГДЕ
	               |	МетодыРаспределенияКосвенныхЗатратОрганизацийСрезПоследних.НеДействует = ЛОЖЬ";
	Запрос.УстановитьПараметр("Период",							Период);
	Запрос.УстановитьПараметр("Организация",					Организация);
	Запрос.УстановитьПараметр("ВидОбщихЗатратНаПроизводство",	ВидОбщихЗатратНаПроизводство);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		Если Выборка.ОсновнаяБаза Тогда
			
			БазаРаспределения 			= Выборка.БазаРаспределения;
			ВключатьВБазуОплатаТрудаКЭК212 = Выборка.ВключатьВБазуОплатаТрудаКЭК212;
			ВключатьВБазуОплатаТрудаКЭК213 = Выборка.ВключатьВБазуОплатаТрудаКЭК213;
			ВключатьВБазуОплатаТрудаКЭК214 = Выборка.ВключатьВБазуОплатаТрудаКЭК214;
			БазаРаспределенияПрежняя	= Выборка.БазаРаспределения;
			
		Иначе
			ЗаполнитьЗначенияСвойств(РасширеннаяНастройка.Добавить(), Выборка);
			ЗаполнитьЗначенияСвойств(РасширеннаяНастройкаПрежняя.Добавить(), Выборка);
		КонецЕсли;
		
	КонецЦикла; 

КонецПроцедуры // ПрочитатьМетодыРаспределения()

&НаСервере
Функция ЗаписатьМетодыРаспределения()

	Если НЕ ЭтоНовый И Период <> ПериодПрежний Тогда	
		НаборЗаписей = РегистрыСведений.МетодыРаспределенияКосвенныхЗатратОрганизаций.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(ПериодПрежний);
		НаборЗаписей.Отбор.Организация.Установить(Организация);
		НаборЗаписей.Отбор.ВидОбщихЗатратНаПроизводство.Установить(ВидОбщихЗатратНаПроизводство);
		НаборЗаписей.Записать(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МетодыРаспределенияКосвенныхЗатратОрганизацийСрезПоследних.КФО,
	               |	МетодыРаспределенияКосвенныхЗатратОрганизацийСрезПоследних.ИФО,
	               |	МетодыРаспределенияКосвенныхЗатратОрганизацийСрезПоследних.БазаРаспределения,
	               |	МетодыРаспределенияКосвенныхЗатратОрганизацийСрезПоследних.НеДействует,
	               |	МетодыРаспределенияКосвенныхЗатратОрганизацийСрезПоследних.ОсновнаяБаза,
	               |	МетодыРаспределенияКосвенныхЗатратОрганизацийСрезПоследних.ВключатьВБазуОплатаТрудаКЭК212,
	               |	МетодыРаспределенияКосвенныхЗатратОрганизацийСрезПоследних.ВключатьВБазуОплатаТрудаКЭК213,
	               |	МетодыРаспределенияКосвенныхЗатратОрганизацийСрезПоследних.ВключатьВБазуОплатаТрудаКЭК214
	               |ИЗ
	               |	РегистрСведений.МетодыРаспределенияКосвенныхЗатратОрганизаций.СрезПоследних(
	               |			&Период,
	               |			Организация = &Организация
	               |				И ВидОбщихЗатратНаПроизводство = &ВидОбщихЗатратНаПроизводство) КАК МетодыРаспределенияКосвенныхЗатратОрганизацийСрезПоследних
	               |ГДЕ
	               |	МетодыРаспределенияКосвенныхЗатратОрганизацийСрезПоследних.ОсновнаяБаза = ЛОЖЬ
	               |	И МетодыРаспределенияКосвенныхЗатратОрганизацийСрезПоследних.НеДействует = ЛОЖЬ";
	Запрос.УстановитьПараметр("Период",							Период - 1);
	Запрос.УстановитьПараметр("Организация",					Организация);
	Запрос.УстановитьПараметр("ВидОбщихЗатратНаПроизводство",	ВидОбщихЗатратНаПроизводство);
	ПредыдущиеЗначения = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписей = РегистрыСведений.МетодыРаспределенияКосвенныхЗатратОрганизаций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Отбор.ВидОбщихЗатратНаПроизводство.Установить(ВидОбщихЗатратНаПроизводство);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Период;
	НоваяЗапись.Организация = Организация;
	НоваяЗапись.ВидОбщихЗатратНаПроизводство = ВидОбщихЗатратНаПроизводство;
	НоваяЗапись.БазаРаспределения = БазаРаспределения;
	НоваяЗапись.ОсновнаяБаза = Истина;
	НоваяЗапись.ВключатьВБазуОплатаТрудаКЭК212 = ВключатьВБазуОплатаТрудаКЭК212;
	НоваяЗапись.ВключатьВБазуОплатаТрудаКЭК213 = ВключатьВБазуОплатаТрудаКЭК213;
	НоваяЗапись.ВключатьВБазуОплатаТрудаКЭК214 = ВключатьВБазуОплатаТрудаКЭК214;
	
	Для каждого НоваяНастрока Из РасширеннаяНастройка Цикл
	
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = Период;
		НоваяЗапись.Организация						= Организация;
		НоваяЗапись.ВидОбщихЗатратНаПроизводство	= ВидОбщихЗатратНаПроизводство;
		НоваяЗапись.БазаРаспределения				= НоваяНастрока.БазаРаспределения;
		НоваяЗапись.ИФО								= НоваяНастрока.ИФО;
		НоваяЗапись.КФО								= НоваяНастрока.КФО;
		НоваяЗапись.ВключатьВБазуОплатаТрудаКЭК212  = НоваяНастрока.ВключатьВБазуОплатаТрудаКЭК212;
		НоваяЗапись.ВключатьВБазуОплатаТрудаКЭК213  = НоваяНастрока.ВключатьВБазуОплатаТрудаКЭК213;
		НоваяЗапись.ВключатьВБазуОплатаТрудаКЭК214  = НоваяНастрока.ВключатьВБазуОплатаТрудаКЭК214;
	
	КонецЦикла;
	
	Для каждого ПредыдущееЗначение Из ПредыдущиеЗначения Цикл
	
		Отбор = Новый Структура("ИФО, КФО", ПредыдущееЗначение.ИФО, ПредыдущееЗначение.КФО);
		Если РасширеннаяНастройка.НайтиСтроки(Отбор).Количество() = 0 Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период = Период;
			НоваяЗапись.Организация						= Организация;
			НоваяЗапись.ВидОбщихЗатратНаПроизводство	= ВидОбщихЗатратНаПроизводство;
			НоваяЗапись.БазаРаспределения				= ПредыдущееЗначение.БазаРаспределения;
			НоваяЗапись.ИФО								= ПредыдущееЗначение.ИФО;
			НоваяЗапись.КФО								= ПредыдущееЗначение.КФО;
			НоваяЗапись.НеДействует						= Истина;
			НоваяЗапись.ВключатьВБазуОплатаТрудаКЭК212  = ПредыдущееЗначение.ВключатьВБазуОплатаТрудаКЭК212;
			НоваяЗапись.ВключатьВБазуОплатаТрудаКЭК213  = ПредыдущееЗначение.ВключатьВБазуОплатаТрудаКЭК213;
			НоваяЗапись.ВключатьВБазуОплатаТрудаКЭК214  = ПредыдущееЗначение.ВключатьВБазуОплатаТрудаКЭК214;
		КонецЕсли;
	
	КонецЦикла; 
	
	НаборЗаписей.Записать(Истина);
	
	Возврат Истина;
	
КонецФункции // ЗаписатьМетодыРаспределения()

&НаКлиенте
Функция ДанныеЗаполненыКорректно()
	
	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Период) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнен обязательный реквизит ""Начало действия""'"),,,"Период", Отказ);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(БазаРаспределения) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнен обязательный реквизит ""База распределения""'"),,,"БазаРаспределения", Отказ);
	КонецЕсли;
	
	ИндексСтроки = 1;
	Для каждого СтрокаНастройки Из РасширеннаяНастройка Цикл
	
		Если Не (ЗначениеЗаполнено(СтрокаНастройки.ИФО) ИЛИ ЗначениеЗаполнено(СтрокаНастройки.КФО)) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
																	НСтр("ru = 'В строке %1 должен быть заполнен ИФО или КФО'"),
																	ИндексСтроки),
																	,,"РасширеннаяНастройка[" + ИндексСтроки + "].КФО", Отказ);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаНастройки.БазаРаспределения) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
																	НСтр("ru = 'В строке %1 не заполнен обязательный реквизит ""База распределения""'"),
																	ИндексСтроки),
																	,,"РасширеннаяНастройка[" + ИндексСтроки + "].БазаРаспределения", Отказ);
		КонецЕсли;
	    ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла; 
	
	Возврат НЕ Отказ;

КонецФункции

#КонецОбласти
